/**
 * classpath - это список директорий, в которой нужно искать .java или .class файлы
 * для компиляции или запуска
 * почему hashcode может не означать, что объекты equals - потому что int ограничен
 *
 * hashcode основан на псевдослучайных числах
 *
 * почему контракт должен быть выполняться? для корректной работы HashMap
 *
 * list упорядочен
 *
 * HashMap load factor 0.75
 *
 * TreeMap работает как черно-красное дерево
 *
 * protected можно видеть в пакете
 *
 * конструктор родителя зовется в начале
 *
 * класс загружается класс лоадером, который загрузил класс выше
 *
 * JMM - спецификация, которая говорит, когда и что видит поток в памяти
 */
package ru.sbt.bit.java.lesson9;